// JavaScript練習問題

// 問題１
// 次のプログラムを実行した時、コンソールには何が表示されるか？

// let a = 1;
// let a = 2;
// console.log(a)

// 問題２
// 次のプログラムを実行した時、コンソールには何が表示されるか？

// const a = 1;
// let a = 2;
// console.log(a)

// 問題３
// 次のプログラムを実行した時、コンソールには何が表示されるか？

// var a = 1;
// var a = 2;
// console.log(a)

// 問題４
// 次のプログラムを実行した時、コンソールには何が表示されるか？

// { var a = 1; }
// a = 2;
// console.log(a)

// 問題５
// 次のプログラムを実行した時、コンソールには何が表示されるか？

// { let a = 1 }
// console.log(a)

// 問題６
// 次のプログラムを実行した時、コンソールには何が表示されるか？

console.log(0 === "0")